driver-tests/bpelse/assign/AssignJbi/test/results/echoDateTimeDataType_Invoke/Actual_20130314144913_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoDateTimeDataType" xmlns:msgns="http://stc.com/echoDateTimeDataType">
      <string>2014-06-09T08:15:04-07:00</string>
      <normalizedString>2014-06-09T08:15:04-07:00</normalizedString>
      <token>2014-06-09T08:15:04-07:00</token>
      <base64Binary>2014-06-09T08:15:04-07:00</base64Binary>
      <hexBinary>2014-06-09T08:15:04-07:00</hexBinary>
      <integer>2014-06-09T08:15:04-07:00</integer>
      <positiveInteger>2014-06-09T08:15:04-07:00</positiveInteger>
      <negativeInteger>2014-06-09T08:15:04-07:00</negativeInteger>
      <nonNegativeInteger>2014-06-09T08:15:04-07:00</nonNegativeInteger>
      <nonPositiveInteger>2014-06-09T08:15:04-07:00</nonPositiveInteger>
      <long>2014-06-09T08:15:04-07:00</long>
      <unsignedLong>2014-06-09T08:15:04-07:00</unsignedLong>
      <int>2014-06-09T08:15:04-07:00</int>
      <unsignedInt>2014-06-09T08:15:04-07:00</unsignedInt>
      <short>2014-06-09T08:15:04-07:00</short>
      <unsignedShort>2014-06-09T08:15:04-07:00</unsignedShort>
      <byte>2014-06-09T08:15:04-07:00</byte>
      <unsignedByte>2014-06-09T08:15:04-07:00</unsignedByte>
      <decimal>2014-06-09T08:15:04-07:00</decimal>
      <float>2014-06-09T08:15:04-07:00</float>
      <double>2014-06-09T08:15:04-07:00</double>
      <boolean>2014-06-09T08:15:04-07:00</boolean>
      <duration>2014-06-09T08:15:04-07:00</duration>
      <dateTime>2014-06-09T08:15:04-07:00</dateTime>
      <date>2014-06-09T08:15:04-07:00</date>
      <time>2014-06-09T08:15:04-07:00</time>
      <gYear>2014-06-09T08:15:04-07:00</gYear>
      <gYearMonth>2014-06-09T08:15:04-07:00</gYearMonth>
      <gMonth>2014-06-09T08:15:04-07:00</gMonth>
      <gMonthDay>2014-06-09T08:15:04-07:00</gMonthDay>
      <gDay>2014-06-09T08:15:04-07:00</gDay>
      <Name>2014-06-09T08:15:04-07:00</Name>
      <QName>2014-06-09T08:15:04-07:00</QName>
      <NCName>2014-06-09T08:15:04-07:00</NCName>
      <anyURI>2014-06-09T08:15:04-07:00</anyURI>
      <language>2014-06-09T08:15:04-07:00</language>
      <ID>2014-06-09T08:15:04-07:00</ID>
      <IDREF>2014-06-09T08:15:04-07:00</IDREF>
      <IDREFS>2014-06-09T08:15:04-07:00</IDREFS>
      <ENTITY>2014-06-09T08:15:04-07:00</ENTITY>
      <ENTITIES>2014-06-09T08:15:04-07:00</ENTITIES>
      <NMTOKEN>2014-06-09T08:15:04-07:00</NMTOKEN>
      <NMTOKENS>2014-06-09T08:15:04-07:00</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>